1s/ERP/Conf/Catalogs/Лико_ВидыСекций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ВидыСекций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Намотка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размотка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многострочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыРедактированияПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтоброжатьИерархиюПриВыборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВТЧЦвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВТЧРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТМЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВидТМЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тиснение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ламинация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткоеДизнайнеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оснастка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Печать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСекций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ПараметрыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНаФорме</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидНаФорме</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ПараметрыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЗаливки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаливки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидЗаливки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ВидыСекций/Forms/Лико_РедактированиеПараметровСекции/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	Адрес  = ЗаписатьВХранилище();
    Оповестить("Адрес",Адрес,);
	Закрыть(Адрес);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение,
			"Изменения не будут сохранены! Продолжить?",
			РежимДиалогаВопрос.ДаНет,
			0, // таймаут в секундах
			КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
			"Оповещение"); 
	Иначе
		Закрыть();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт 
    Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть();
	Иначе
		Возврат;
    КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменениеРеквизита(Элемент)
	Если Не Модифицированность Тогда 
		Модифицированность = Истина;
	КонецЕсли;
	
	ДоступностьПолей(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПолей(ЭлементИмя)
	
	Если ЭлементИмя = "ВидТМЦ" Тогда
		текКраска = ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Краска");
		
		РезультатТипЦвета = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "ТипЦвета");
		Если РезультатТипЦвета Тогда
			Элементы["ТипЦвета"].Видимость = ?(ЗначениеЗаполнено(ЭтаФорма["ВидТМЦ"]), (текКраска = ЭтаФорма["ВидТМЦ"]), Ложь); 
		КонецЕсли;
		
		РезультатТипЦвета = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "ВидЗаливки");
		Если РезультатТипЦвета Тогда
			Элементы["ВидЗаливки"].Видимость = ?(ЗначениеЗаполнено(ЭтаФорма["ВидТМЦ"]), (текКраска <> ЭтаФорма["ВидТМЦ"]), Ложь); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Секция") Тогда
    	Сообщить("Вид секции не задан!");    
		Возврат;
	Иначе
		Если Не ЗначениеЗаполнено(Параметры.Секция) Тогда
			Сообщить("Вид секции не задан!");    
			Возврат;
		КонецЕсли;
	КонецЕсли;		
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	МетаданныеДокумента = Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Секции.Реквизиты;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Секция",  Новый ОписаниеТипов("СправочникСсылка.Лико_ВидыСекций")));
			
	Для Каждого текСекция Из Параметры.Секция.ПараметрыСекций Цикл
		ПараметрСекции = текСекция.ПараметрСекции;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ПараметрСекции.Наименование, МетаданныеДокумента[ПараметрСекции.Наименование].Тип, , 
			?(ЗначениеЗаполнено(текСекция.Синоним), текСекция.Синоним, ПараметрСекции.Синоним)));
	КонецЦикла;	
			
	// Добавим новые реквизиты в форму
	этаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НомерЭллемента = 1;
	текТабПараметры = Параметры.Секция.ЗначенияПараметров.Выгрузить();
	Для Каждого ПараметрСекции Из Параметры.Секция.ПараметрыСекций Цикл
		
		ГруппаФормы = ?(НомерЭллемента%2=0, Элементы.ГруппаПравая, Элементы.ГруппаЛевая); 
		ИмяЭлемента = ПараметрСекции.ПараметрСекции.Наименование;
		Если этаФорма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы = этаФорма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);
			
			//Переключатель
			Если ПараметрСекции.ВидНаФорме = Справочники.Лико_ВидНаФорме.Переключатель Тогда
				ЭлементФормы.Вид = ВидПоляФормы.ПолеПереключателя;
				ЭлементФормы.ВидПереключателя = ВидПереключателя.Тумблер;
				
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ПараметрСекции", ПараметрСекции.ПараметрСекции);
				НайденныеСтроки = текТабПараметры.НайтиСтроки(ПараметрыОтбора);
				Для каждого ТекЭллемент из НайденныеСтроки Цикл
					ЭлементФормы.СписокВыбора.Добавить(ТекЭллемент.Значение);
				КонецЦикла;
				//текКоличествоТумблеров = НайденныеСтроки.Количество();
				текКоличествоКолонок = Цел(НайденныеСтроки.Количество() / 5);
				Если текКоличествоКолонок > 0 Тогда
					ЭлементФормы.КоличествоКолонок = 5;
					//Новая строчка из Тумблеров
				КонецЕсли;
				//Флажок
			ИначеЕсли ПараметрСекции.ВидНаФорме = Справочники.Лико_ВидНаФорме.Флажок Тогда
				ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
				//Остальное считаем, как поле ввода.
				
					
			Иначе 				
				ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
				ЭлементФормы.УстановитьДействие("НачалоВыбора", "НачалоВыбораРеквизита")
			КонецЕсли;
			ЭлементФормы.ПутьКДанным = ИмяЭлемента;
			ЭлементФормы.УстановитьДействие("ПриИзменении", "ПриИзменениеРеквизита");

			//этаФорма[ИмяЭлемента] = этаФорма.Объект[ИмяЭлемента];
		КонецЕсли;   	
		НомерЭллемента = НомерЭллемента + 1;
		
		ТекПараметрСекции = ПараметрСекции.ПараметрСекции;
		Если ТекПараметрСекции.ВыводитьАртикул ИЛИ ТекПараметрСекции.ВыводитьКод Тогда
			Если ТекПараметрСекции.ВыводитьАртикул Тогда
				текИмяДоп = "Артикул";
			ИначеЕсли ТекПараметрСекции.ВыводитьКод Тогда
				текИмяДоп = "Код";
			КонецЕсли;
			ЭлементФормыДоп 				= этаФорма.Элементы.Добавить(ИмяЭлемента + текИмяДоп, Тип("ПолеФормы"), ГруппаФормы);
			ЭлементФормыДоп.Вид 			= ВидПоляФормы.ПолеНадписи;
			ЭлементФормыДоп.ПутьКДанным 	= ИмяЭлемента + "." + текИмяДоп;
			ЭлементФормыДоп.Заголовок 		= ИмяЭлемента + " (" + текИмяДоп + ")";
			//Элементы.ГруппаПравая.ПодчиненныеЭлементы.Количество()
		КонецЕсли;

	КонецЦикла;
	
	Если Параметры.Свойство("ПараметрыСекции") Тогда
		Если ЗначениеЗаполнено(Параметры.ПараметрыСекции) Тогда
			СтруктураПараметров = ЗначениеИзСтрокиВнутр(Параметры.ПараметрыСекции);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураПараметров);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Секция.ОтображениеНаФорме = "ГруппаЦвета" Тогда  
		
		Элементы.ГруппаЦвета.Видимость = Истина;
		
	КонецЕсли;
	
	Если Параметры.Секция.ОтображениеНаФорме = "ГруппаМатериалыРаботы" Тогда  
		
		Элементы.ГруппаМатериалыРаботы.Видимость = Истина;
		
	КонецЕсли;


	
КонецПроцедуры

&НаСервере
Функция ЗаписатьВХранилище()
	СтруктураЭлементов = Новый Структура;
	СтруктураЭлементов.Вставить("Секция", ЭтаФорма["Секция"]);
	Для каждого Эллемент из ЭтаФорма.Элементы Цикл
		Если НЕ (Эллемент.Вид = ВидПоляФормы.ПолеВвода ИЛИ Эллемент.Вид = ВидПоляФормы.ПолеПереключателя ИЛИ Эллемент.Вид = ВидПоляФормы.ПолеФлажка)  Тогда 
			Продолжить;
		КонецЕсли;
		текПутьКДанным = Эллемент.ПутьКДанным;
		СтруктураЭлементов.Вставить(текПутьКДанным, ЭтотОбъект[текПутьКДанным]); 	
	КонецЦикла;
    Возврат ЗначениеВСтрокуВнутр(СтруктураЭлементов); 
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбора(Ссылка, Элемент)
	 ПараметрыФормы  = Новый Структура;        
    Отбор = Новый Структура;
    
    // здесь формируем отборы
    
    ПараметрыФормы.Вставить("Отбор", Отбор);
    
    ИмяФормыВыбора = ПолучитьИмяФормыВыбораПоСсылке(Ссылка);
    ФормаВыбора = ПолучитьФорму(ИмяФормыВыбора, ПараметрыФормы, Элемент);
    ФормаВыбора.Заголовок = "Форма выбора с моим отбором";
    ФормаВыбора.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФормыВыбораПоСсылке(Ссылка)
    Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаВыбора";
КонецФункции

&НаКлиенте
Процедура НачалоВыбораРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя = "Материал" ИЛИ Элемент.Имя = "ТипПродукта" Тогда 		
		СтандартнаяОбработка = Ложь;
		ЭтоМножественныйТип = ТипЗнч(ЭтаФорма[Элемент.Имя]) = Тип("Неопределено");
		текПараметра = Новый Структура;
		текПараметра.Вставить("Элемент", Элемент); 
		Если ЭтоМножественныйТип Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ОткрытиеФормыВыбораВЗависимостиОтТипа", ЭтаФорма, текПараметра);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Это Ценовая группа?'"), Режим,0);
		Иначе
			ОткрытиеФормыВыбораВЗависимостиОтТипа(Неопределено, текПараметра);	
		КонецЕсли;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя = "Материал" ИЛИ Элемент.Имя = "ТипПродукта" Тогда 		
		СтандартнаяОбработка = Ложь;
		ЭтоМножественныйТип = ТипЗнч(ЭтаФорма[Элемент.Имя]) = Тип("Неопределено");
		текПараметра = Новый Структура;
		текПараметра.Вставить("Элемент", Элемент); 
		Если ЭтоМножественныйТип Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ОткрытиеФормыВыбораВЗависимостиОтТипа", ЭтаФорма, текПараметра);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Это Ценовая группа?'"), Режим,0);
		Иначе
			ОткрытиеФормыВыбораВЗависимостиОтТипа(Неопределено, текПараметра);	
		КонецЕсли;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФормыВыбораВЗависимостиОтТипа(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДляФормы = Новый Структура;
	Если Параметры.Элемент.Имя = "Материал" Тогда
		ПараметрыДляФормы.Вставить("Лико_ВидТМЦ", ПредопределенноеЗначение("Справочник.Лико_ВидыТМЦ.Материал"));
	КонецЕсли;
	ПараметрыДляФормы.Вставить("ВидСекции", ЭтаФорма.Секция); 
	ПараметрыДляФормы.Вставить("ВидПечати", ПолучитьВидПечатиИзСекцииНаСервере());

	Если Результат = КодВозвратаДиалога.Нет Тогда
        текФорма = ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбораДляЗаказа", ПараметрыДляФормы, Параметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
        текФорма = ОткрытьФорму("Справочник.ЦеновыеГруппы.Форма.Лико_ФормаВыбораДляЗаказа", ПараметрыДляФормы, Параметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьВидПечатиИзСекцииНаСервере()

	Возврат ЭтаФорма.Секция.ВидПечати; 
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "ВидТМЦ") Тогда
		ДоступностьПолей("ВидТМЦ");
	КонецЕсли;
	
	//Если Параметры.Отображение = "ГруппаЦвета" Тогда  
	//	
	//	Элементы.ГруппаЦвета.Видимость = Истина;
	//	
	//КонецЕсли;
	
КонецПроцедуры
